export default {
  project_empty_state: {
    epics: {
      title: "Превратите сложные проекты в структурированные эпики.",
      description: "Эпик помогает организовать большие цели в более мелкие, отслеживаемые задачи.",
      cta_primary: "Создать эпик",
      cta_secondary: "Документация",
    },
    epic_work_items: {
      title: "Вы еще не добавили рабочие элементы в этот эпик.",
      description: "Начните с добавления рабочих элементов в этот эпик и отслеживайте их здесь.",
      cta_secondary: "Добавить рабочие элементы",
    },
  },
  workspace_empty_state: {
    home_widget_stickies: {
      title: "Запишите идею, зафиксируйте озарение или запомните внезапную мысль. Добавьте стикер, чтобы начать.",
    },
    stickies: {
      title: "Запишите идею, зафиксируйте озарение или запомните внезапную мысль. Добавьте стикер, чтобы начать.",
      cta_primary: "Добавить стикер",
    },
    active_cycles: {
      title: "Нет активных циклов",
      description:
        "У вас сейчас нет активных циклов. Активные циклы появляются здесь, когда они включают сегодняшнюю дату.",
    },
    teamspaces: {
      title: "С командными пространствами откройте лучшую организацию и отслеживание",
      description:
        "Создайте выделенное пространство для каждой реальной команды, отдельное от всех других рабочих поверхностей в Plane, и настройте их в соответствии с тем, как работает ваша команда.",
      cta_primary: "Создать новое командное пространство",
    },
    initiatives: {
      title: "Отслеживайте проекты и эпики из одного места",
      description:
        "Используйте инициативы для группировки и мониторинга связанных проектов и эпиков. Просматривайте прогресс, приоритеты и результаты — все с одного экрана.",
      cta_primary: "Создать инициативу",
    },
    customers: {
      title: "Управляйте работой по тому, что важно для ваших клиентов",
      description:
        "Связывайте запросы клиентов с рабочими элементами, назначайте приоритет по запросам и сворачивайте состояния рабочих элементов в записи клиентов. Скоро вы сможете интегрироваться с вашей CRM или инструментом поддержки для еще лучшего управления работой по атрибутам клиентов.",
      cta_primary: "Создать запись клиента",
    },
    dashboard: {
      title: "Визуализируйте свой прогресс с помощью панелей",
      description:
        "Создавайте настраиваемые панели для отслеживания метрик, измерения результатов и эффективного представления аналитики.",
      cta_primary: "Создать новую панель",
    },
    wiki: {
      title: "Напишите заметку, документ или полную базу знаний.",
      description:
        "Страницы — это пространство для фиксации мыслей в Plane. Делайте заметки со встреч, легко форматируйте их, встраивайте рабочие элементы, размещайте их с помощью библиотеки компонентов и храните все в контексте вашего проекта.",
      cta_primary: "Создать вашу страницу",
    },
  },
  settings_empty_state: {
    teamspace: {
      title: "Командных пространств пока нет",
      description:
        "Соберите своих участников в командном пространстве для отслеживания прогресса, рабочей нагрузки и активности — без усилий. Узнать больше",
      cta_primary: "Добавить командное пространство",
    },
    work_item_types: {
      title: "Создавайте и настраивайте типы рабочих элементов",
      description:
        "Определите уникальные типы рабочих элементов для вашего проекта. Каждый тип может иметь свои собственные свойства, рабочие процессы и поля — адаптированные к потребностям вашего проекта и команды.",
      cta_primary: "Включить",
    },
    work_item_type_properties: {
      title:
        "Определите свойство и детали, которые вы хотите зафиксировать для этого типа рабочего элемента. Настройте его в соответствии с рабочим процессом вашего проекта.",
      cta_secondary: "Добавить свойство",
    },
    epic_setting: {
      title: "Включить эпики",
      description:
        "Группируйте связанные рабочие элементы в более крупные блоки, охватывающие несколько циклов и модулей — идеально подходит для отслеживания прогресса в целом.",
      cta_primary: "Включить",
    },
    templates: {
      title: "Шаблонов пока нет",
      description:
        "Сократите время настройки, создавая шаблоны для рабочих элементов и страниц — и начинайте новую работу за секунды.",
      cta_primary: "Создать свой первый шаблон",
    },
    recurring_work_items: {
      title: "Повторяющихся рабочих элементов пока нет",
      description:
        "Настройте повторяющиеся рабочие элементы для автоматизации повторяющихся задач и легкого соблюдения графика.",
      cta_primary: "Создать повторяющийся рабочий элемент",
    },
    worklogs: {
      title: "Отслеживайте учет времени для всех участников",
      description:
        "Регистрируйте время на рабочих элементах, чтобы просматривать подробные табели для любого члена команды по проектам.",
    },
    customers_setting: {
      title: "Включите управление клиентами, чтобы начать.",
      cta_primary: "Включить",
    },
    template_setting: {
      title: "Шаблонов пока нет",
      description:
        "Сократите время настройки, создавая шаблоны для проектов, рабочих элементов и страниц — и начинайте новую работу за секунды.",
      cta_primary: "Создать шаблон",
    },
    webhooks: {
      title: "Вебхуков пока не добавлено",
      description: "Автоматизируйте уведомления внешних сервисов при возникновении событий проекта.",
      cta_primary: "Добавить вебхук",
    },
  },
} as const;
