export default {
  project_empty_state: {
    epics: {
      title: "Перетворюйте складні проєкти на структуровані епіки.",
      description: "Епік допомагає вам організовувати великі цілі в менші, відстежувані завдання.",
      cta_primary: "Створити Епік",
      cta_secondary: "Документація",
    },
    epic_work_items: {
      title: "Ви ще не додали робочі елементи до цього епіка.",
      description: "Почніть з додавання деяких робочих елементів до цього епіка та відстежуйте їх тут.",
      cta_secondary: "Додати робочі елементи",
    },
  },
  workspace_empty_state: {
    home_widget_stickies: {
      title: "Запишіть ідею, зафіксуйте осяяння або запам'ятайте раптову думку. Додайте стікер, щоб почати.",
    },
    stickies: {
      title: "Запишіть ідею, зафіксуйте осяяння або запам'ятайте раптову думку. Додайте стікер, щоб почати.",
      cta_primary: "Додати стікер",
    },
    active_cycles: {
      title: "Немає активних циклів",
      description:
        "У вас зараз немає поточних циклів. Активні цикли з'являються тут, коли вони включають сьогоднішню дату.",
    },
    teamspaces: {
      title: "З командними просторами відкрийте кращу організацію та відстеження",
      description:
        "Створіть виділену поверхню для кожної реальної команди, окремо від усіх інших робочих поверхонь у Plane, та налаштуйте їх відповідно до того, як працює ваша команда.",
      cta_primary: "Створити новий Командний простір",
    },
    initiatives: {
      title: "Відстежуйте проєкти та епіки з одного місця",
      description:
        "Використовуйте ініціативи для групування та моніторингу пов'язаних проєктів та епіків. Переглядайте прогрес, пріоритети та результати—все з одного екрана.",
      cta_primary: "Створити Ініціативу",
    },
    customers: {
      title: "Керуйте роботою за тим, що важливо для ваших клієнтів",
      description:
        "Приносьте запити клієнтів до робочих елементів, призначайте пріоритет за запитами та згортайте стани робочих елементів у записи клієнтів. Незабаром ви зможете інтегруватися з вашою CRM або інструментом підтримки для ще кращого управління роботою за атрибутами клієнтів.",
      cta_primary: "Створити запис клієнта",
    },
    dashboard: {
      title: "Візуалізуйте свій прогрес за допомогою панелей",
      description:
        "Створюйте налаштовувані панелі для відстеження метрик, вимірювання результатів та ефективного представлення аналітики.",
      cta_primary: "Створити нову панель",
    },
    wiki: {
      title: "Напишіть нотатку, документ або повну базу знань.",
      description:
        "Сторінки — це простір для фіксації думок у Plane. Робіть нотатки зустрічей, легко форматуйте їх, вбудовуйте робочі елементи, розміщуйте їх за допомогою бібліотеки компонентів і зберігайте все в контексті вашого проєкту.",
      cta_primary: "Створіть вашу сторінку",
    },
  },
  settings_empty_state: {
    teamspace: {
      title: "Ще немає командного простору",
      description:
        "Зберіть своїх учасників у командному просторі для відстеження прогресу, робочого навантаження та активності — без зусиль. Дізнатися більше",
      cta_primary: "Додати командний простір",
    },
    work_item_types: {
      title: "Створюйте та налаштовуйте типи робочих елементів",
      description:
        "Визначте унікальні типи робочих елементів для вашого проєкту. Кожен тип може мати власні властивості, робочі процеси та поля — адаптовані до потреб вашого проєкту та команди.",
      cta_primary: "Увімкнути",
    },
    work_item_type_properties: {
      title:
        "Визначте властивість та деталі, які ви хочете зафіксувати для цього типу робочого елемента. Налаштуйте його відповідно до робочого процесу вашого проєкту.",
      cta_secondary: "Додати властивість",
    },
    epic_setting: {
      title: "Увімкнути Епіки",
      description:
        "Групуйте пов'язані робочі елементи в більші блоки, що охоплюють декілька циклів та модулів — ідеально для відстеження прогресу в цілому.",
      cta_primary: "Увімкнути",
    },
    templates: {
      title: "Ще немає шаблонів",
      description:
        "Скоротіть час налаштування, створюючи шаблони для робочих елементів та сторінок — і починайте нову роботу за секунди.",
      cta_primary: "Створіть свій перший шаблон",
    },
    recurring_work_items: {
      title: "Ще немає повторюваного робочого елемента",
      description:
        "Налаштуйте повторювані робочі елементи для автоматизації повторюваних завдань та легкого дотримання графіка.",
      cta_primary: "Створити повторюваний робочий елемент",
    },
    worklogs: {
      title: "Відстежуйте табелі обліку часу для всіх учасників",
      description:
        "Реєструйте час на робочих елементах для перегляду детальних табелів для будь-якого члена команди по проєктах.",
    },
    customers_setting: {
      title: "Увімкніть управління клієнтами, щоб почати.",
      cta_primary: "Увімкнути",
    },
    template_setting: {
      title: "Ще немає шаблонів",
      description:
        "Скоротіть час налаштування, створюючи шаблони для проєктів, робочих елементів та сторінок — і починайте нову роботу за секунди.",
      cta_primary: "Створити шаблон",
    },
    webhooks: {
      title: "Ще не додано Webhook",
      description: "Автоматизуйте сповіщення зовнішнім сервісам, коли відбуваються події проєкту.",
      cta_primary: "Додати webhook",
    },
  },
} as const;
