/**
 * SPDX-FileCopyrightText: 2023-present Plane Software, Inc.
 * SPDX-License-Identifier: LicenseRef-Plane-Commercial
 *
 * Licensed under the Plane Commercial License (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * https://plane.so/legals/eula
 *
 * DO NOT remove or modify this notice.
 * NOTICE: Proprietary and confidential. Unauthorized use or distribution is prohibited.
 */

export default {
  common_empty_state: {
    progress: {
      title: "Ще немає метрик прогресу для відображення.",
      description:
        "Почніть встановлювати значення властивостей у робочих елементах, щоб побачити тут метрики прогресу.",
    },
    updates: {
      title: "Ще немає оновлень.",
      description: "Як тільки учасники проєкту додадуть оновлення, вони з'являться тут",
    },
    search: {
      title: "Немає відповідних результатів.",
      description: "Результатів не знайдено. Спробуйте змінити пошукові терміни.",
    },
    not_found: {
      title: "Ой! Щось здається не так",
      description: "Ми не можемо отримати ваш обліковий запис plane зараз. Це може бути помилка мережі.",
      cta_primary: "Спробуйте перезавантажити",
    },
    server_error: {
      title: "Помилка сервера",
      description: "Ми не можемо підключитися та отримати дані з нашого сервера. Не хвилюйтеся, ми працюємо над цим.",
      cta_primary: "Спробуйте перезавантажити",
    },
  },
  project_empty_state: {
    no_access: {
      title: "Схоже, у вас немає доступу до цього проєкту",
      restricted_description: "Зверніться до адміністратора, щоб запросити доступ, і ви зможете продовжити тут.",
      join_description: "Натисніть кнопку нижче, щоб приєднатися.",
      cta_primary: "Приєднатися до проєкту",
      cta_loading: "Приєднання до проєкту",
    },
    invalid_project: {
      title: "Проєкт не знайдено",
      description: "Проєкт, який ви шукаєте, не існує.",
    },
    work_items: {
      title: "Почніть з вашого першого робочого елемента.",
      description:
        "Робочі елементи є будівельними блоками вашого проєкту — призначайте власників, встановлюйте пріоритети та легко відстежуйте прогрес.",
      cta_primary: "Створіть свій перший робочий елемент",
    },
    cycles: {
      title: "Групуйте та обмежуйте за часом вашу роботу в Циклах.",
      description:
        "Розділіть роботу на часові блоки, працюйте назад від кінцевого терміну проєкту для встановлення дат і робіть відчутний прогрес як команда.",
      cta_primary: "Встановіть свій перший цикл",
    },
    cycle_work_items: {
      title: "Немає робочих елементів для відображення в цьому циклі",
      description:
        "Створіть робочі елементи, щоб почати моніторинг прогресу вашої команди в цьому циклі та досягти своїх цілей вчасно.",
      cta_primary: "Створити робочий елемент",
      cta_secondary: "Додати існуючий робочий елемент",
    },
    modules: {
      title: "Відобразіть цілі вашого проєкту на Модулі та легко відстежуйте.",
      description:
        "Модулі складаються з взаємопов'язаних робочих елементів. Вони допомагають моніторити прогрес через фази проєкту, кожна з конкретними термінами та аналітикою, щоб показати, наскільки ви близькі до досягнення цих фаз.",
      cta_primary: "Встановіть свій перший модуль",
    },
    module_work_items: {
      title: "Немає робочих елементів для відображення в цьому Модулі",
      description: "Створіть робочі елементи, щоб почати моніторинг цього модуля.",
      cta_primary: "Створити робочий елемент",
      cta_secondary: "Додати існуючий робочий елемент",
    },
    views: {
      title: "Зберігайте власні подання для вашого проєкту",
      description:
        "Подання є збереженими фільтрами, які допомагають вам швидко отримувати доступ до інформації, яку ви використовуєте найчастіше. Співпрацюйте без зусиль, оскільки члени команди діляться та адаптують подання до своїх конкретних потреб.",
      cta_primary: "Створити подання",
    },
    no_work_items_in_project: {
      title: "У проєкті ще немає робочих елементів",
      description:
        "Додайте робочі елементи до свого проєкту та розділіть свою роботу на відстежувані частини з поданнями.",
      cta_primary: "Додати робочий елемент",
    },
    work_item_filter: {
      title: "Робочих елементів не знайдено",
      description: "Ваш поточний фільтр не повернув результатів. Спробуйте змінити фільтри.",
      cta_primary: "Додати робочий елемент",
    },
    pages: {
      title: "Документуйте все — від нотаток до PRD",
      description:
        "Сторінки дозволяють вам захоплювати та організовувати інформацію в одному місці. Пишіть нотатки зустрічей, проєктну документацію та PRD, вбудовуйте робочі елементи та структуруйте їх за допомогою готових компонентів.",
      cta_primary: "Створіть свою першу Сторінку",
    },
    archive_pages: {
      title: "Ще немає архівованих сторінок",
      description: "Архівуйте сторінки, які не на вашому радарі. Отримуйте до них доступ тут, коли потрібно.",
    },
    intake_sidebar: {
      title: "Реєструйте запити на вхід",
      description:
        "Надсилайте нові запити для перегляду, встановлення пріоритетів та відстеження в рамках робочого процесу вашого проєкту.",
      cta_primary: "Створити запит на вхід",
    },
    intake_main: {
      title: "Виберіть робочий елемент Intake, щоб переглянути його деталі",
    },
    epics: {
      title: "Перетворюйте складні проєкти на структуровані епіки.",
      description: "Епік допомагає вам організовувати великі цілі в менші, відстежувані завдання.",
      cta_primary: "Створити Епік",
      cta_secondary: "Документація",
    },
    epic_work_items: {
      title: "Ви ще не додали робочі елементи до цього епіка.",
      description: "Почніть з додавання деяких робочих елементів до цього епіка та відстежуйте їх тут.",
      cta_secondary: "Додати робочі елементи",
    },
  },
  workspace_empty_state: {
    archive_work_items: {
      title: "Ще немає архівованих робочих елементів",
      description:
        "Вручну або через автоматизацію ви можете архівувати завершені або скасовані робочі елементи. Знайдіть їх тут після архівування.",
      cta_primary: "Налаштувати автоматизацію",
    },
    archive_cycles: {
      title: "Ще немає архівованих циклів",
      description: "Щоб упорядкувати свій проєкт, архівуйте завершені цикли. Знайдіть їх тут після архівування.",
    },
    archive_modules: {
      title: "Ще немає архівованих Модулів",
      description:
        "Щоб упорядкувати свій проєкт, архівуйте завершені або скасовані модулі. Знайдіть їх тут після архівування.",
    },
    home_widget_quick_links: {
      title: "Тримайте під рукою важливі посилання, ресурси або документи для вашої роботи",
    },
    inbox_sidebar_all: {
      title: "Оновлення для ваших підписаних робочих елементів з'являться тут",
    },
    inbox_sidebar_mentions: {
      title: "Згадки для ваших робочих елементів з'являться тут",
    },
    your_work_by_priority: {
      title: "Ще не призначено робочого елемента",
    },
    your_work_by_state: {
      title: "Ще не призначено робочого елемента",
    },
    views: {
      title: "Ще немає Поданнь",
      description:
        "Додайте робочі елементи до свого проєкту та використовуйте подання для фільтрування, сортування та моніторингу прогресу без зусиль.",
      cta_primary: "Додати робочий елемент",
    },
    drafts: {
      title: "Напівнаписані робочі елементи",
      description:
        "Щоб спробувати це, почніть додавати робочий елемент і залиште його на половині або створіть свій перший чернетка нижче. 😉",
      cta_primary: "Створити чернетковий робочий елемент",
    },
    projects_archived: {
      title: "Немає архівованих проєктів",
      description: "Схоже, всі ваші проєкти все ще активні—чудова робота!",
    },
    analytics_projects: {
      title: "Створіть проєкти для візуалізації метрик проєкту тут.",
    },
    analytics_work_items: {
      title:
        "Створіть проєкти з робочими елементами та призначеними особами, щоб почати відстежувати ефективність, прогрес та вплив команди тут.",
    },
    analytics_no_cycle: {
      title: "Створіть цикли для організації роботи в часові фази та відстеження прогресу через спринти.",
    },
    analytics_no_module: {
      title: "Створіть модулі для організації вашої роботи та відстеження прогресу через різні фази.",
    },
    analytics_no_intake: {
      title:
        "Налаштуйте вхід для управління вхідними запитами та відстеження того, як вони приймаються та відхиляються",
    },
    home_widget_stickies: {
      title: "Запишіть ідею, зафіксуйте осяяння або запам'ятайте раптову думку. Додайте стікер, щоб почати.",
    },
    stickies: {
      title: "Фіксуйте ідеї миттєво",
      description: "Створюйте стікери для швидких нотаток та завдань, і тримайте їх при собі, куди б ви не йшли.",
      cta_primary: "Створити перший стікер",
      cta_secondary: "Документація",
    },
    active_cycles: {
      title: "Немає активних циклів",
      description:
        "У вас зараз немає поточних циклів. Активні цикли з'являються тут, коли вони включають сьогоднішню дату.",
    },
    teamspaces: {
      title: "З командними просторами відкрийте кращу організацію та відстеження",
      description:
        "Створіть виділену поверхню для кожної реальної команди, окремо від усіх інших робочих поверхонь у Plane, та налаштуйте їх відповідно до того, як працює ваша команда.",
      cta_primary: "Створити новий Командний простір",
    },
    initiatives: {
      title: "Відстежуйте проєкти та епіки з одного місця",
      description:
        "Використовуйте ініціативи для групування та моніторингу пов'язаних проєктів та епіків. Переглядайте прогрес, пріоритети та результати—все з одного екрана.",
      cta_primary: "Створити Ініціативу",
    },
    customers: {
      title: "Керуйте роботою за тим, що важливо для ваших клієнтів",
      description:
        "Приносьте запити клієнтів до робочих елементів, призначайте пріоритет за запитами та згортайте стани робочих елементів у записи клієнтів. Незабаром ви зможете інтегруватися з вашою CRM або інструментом підтримки для ще кращого управління роботою за атрибутами клієнтів.",
      cta_primary: "Створити запис клієнта",
    },
    dashboard: {
      title: "Візуалізуйте свій прогрес за допомогою панелей",
      description:
        "Створюйте налаштовувані панелі для відстеження метрик, вимірювання результатів та ефективного представлення аналітики.",
      cta_primary: "Створити нову панель",
    },
    wiki: {
      title: "Напишіть нотатку, документ або повну базу знань.",
      description:
        "Сторінки — це простір для фіксації думок у Plane. Робіть нотатки зустрічей, легко форматуйте їх, вбудовуйте робочі елементи, розміщуйте їх за допомогою бібліотеки компонентів і зберігайте все в контексті вашого проєкту.",
      cta_primary: "Створіть вашу сторінку",
    },
    project_overview_state_sidebar: {
      title: "Увімкнути стани проєкту",
      description:
        "Увімкніть стани проєкту для перегляду та керування властивостями, такими як стан, пріоритет, терміни виконання та інше.",
    },
  },
  settings_empty_state: {
    estimates: {
      title: "Ще немає оцінок",
      description:
        "Визначте, як ваша команда вимірює зусилля, та відстежуйте це послідовно для всіх робочих елементів.",
      cta_primary: "Додати систему оцінок",
    },
    labels: {
      title: "Ще немає міток",
      description:
        "Створіть персоналізовані мітки для ефективної категоризації та управління вашими робочими елементами.",
      cta_primary: "Створіть свою першу мітку",
    },
    exports: {
      title: "Ще немає експортів",
      description:
        "Ви зараз не маєте жодних записів експорту. Як тільки ви експортуєте дані, усі записи з'являться тут.",
    },
    tokens: {
      title: "Ще немає Персонального токена",
      description:
        "Генеруйте безпечні API токени для підключення вашого робочого простору до зовнішніх систем та додатків.",
      cta_primary: "Додати API токен",
    },
    webhooks: {
      title: "Ще не додано Webhook",
      description: "Автоматизуйте сповіщення зовнішнім сервісам, коли відбуваються події проєкту.",
      cta_primary: "Додати webhook",
    },
    teamspace: {
      title: "Ще немає командного простору",
      description:
        "Зберіть своїх учасників у командному просторі для відстеження прогресу, робочого навантаження та активності — без зусиль. Дізнатися більше",
      cta_primary: "Додати командний простір",
    },
    work_item_types: {
      title: "Створюйте та налаштовуйте типи робочих елементів",
      description:
        "Визначте унікальні типи робочих елементів для вашого проєкту. Кожен тип може мати власні властивості, робочі процеси та поля — адаптовані до потреб вашого проєкту та команди.",
      cta_primary: "Увімкнути",
    },
    work_item_type_properties: {
      title:
        "Визначте властивість та деталі, які ви хочете зафіксувати для цього типу робочого елемента. Налаштуйте його відповідно до робочого процесу вашого проєкту.",
      cta_secondary: "Додати властивість",
    },
    epic_setting: {
      title: "Увімкнути Епіки",
      description:
        "Групуйте пов'язані робочі елементи в більші блоки, що охоплюють декілька циклів та модулів — ідеально для відстеження прогресу в цілому.",
      cta_primary: "Увімкнути",
    },
    templates: {
      title: "Ще немає шаблонів",
      description:
        "Скоротіть час налаштування, створюючи шаблони для робочих елементів та сторінок — і починайте нову роботу за секунди.",
      cta_primary: "Створіть свій перший шаблон",
    },
    recurring_work_items: {
      title: "Ще немає повторюваного робочого елемента",
      description:
        "Налаштуйте повторювані робочі елементи для автоматизації повторюваних завдань та легкого дотримання графіка.",
      cta_primary: "Створити повторюваний робочий елемент",
    },
    worklogs: {
      title: "Відстежуйте табелі обліку часу для всіх учасників",
      description:
        "Реєструйте час на робочих елементах для перегляду детальних табелів для будь-якого члена команди по проєктах.",
    },
    customers_setting: {
      title: "Увімкніть управління клієнтами, щоб почати.",
      cta_primary: "Увімкнути",
    },
    template_setting: {
      title: "Ще немає шаблонів",
      description:
        "Скоротіть час налаштування, створюючи шаблони для проєктів, робочих елементів та сторінок — і починайте нову роботу за секунди.",
      cta_primary: "Створити шаблон",
    },
  },
} as const;
